src/Catalogs/ШаблоныДиалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ШаблоныДиалогов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонАктивности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАктивности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеАктивации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияАктивации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПовторнойАктивации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыПовторнойАктивации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЭлементыДиалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ЭлементыДиалогов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ШаблоныДиалогов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЭлементаДиалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЭлементовДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующийЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДиалогов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлементыДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Форма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействияЭлементовДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрДействия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаГостя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыФормы</Name>
					<Comment>Для подстановки в отображаемую форму</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭлементыДиалогов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстКнопки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыФормыГостя</Name>
					<Comment>Для подстановки в отображаемую форму</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ШаблоныДиалогов/Forms/ФормаСписка/module.bsl
Процедура АнимированныйГраф(ВыбраннаяСтрока)
		
	
	Обр = ВнешниеОтчеты.Создать("\\cd\root\0_4_ИТ\Кухня_Полли\ГрафоГраф.erf");
	
	Ф = Обр.ПолучитьФорму("ФормаОтчета",ЭтаФорма);
	Ф.Открыть();
	
	Вершины = Обр.Вершины.выгрузить();
	Выб = Справочники.ЭлементыДиалогов.ВыбратьИерархически(,ВыбраннаяСтрока,,"НомерПП");
	ИНд = 2;
	ТекРодитель = "";
	Пока Выб.Следующий() Цикл
		
		ЕСли Выб.Родитель.Пустая() ТОгда
			КолВУровне = 1;
			НомерВУровне =1;
		Иначе
			
			З = Новый Запрос("ВЫБРАТЬ Количество(Ссылка) Кол Из Справочник.ЭлементыДиалогов где Родитель = &Родитель");
			З.УстановитьПараметр("Родитель",Выб.Родитель);
			КолВУровне = З.Выполнить().Выгрузить().Итог("Кол");
			З.Текст = "Выбрать Количество(Ссылка) Номер из Справочник.ЭлементыДиалогов где Родитель = &Родитель И НомерПП <= &НомерПП";
			З.УстановитьПараметр("НомерПП",выб.НомерПП);
			
			НомерВУровне = З.Выполнить().Выгрузить()[0].Номер;
		КонецЕсли;
		Вершина = ОБр.Вершины.Добавить();	
		Вершина.тип=выб.ТипЭлементаДиалога;
		Вершина.Имя = выб.НомерПП + Выб.Ссылка.Наименование;
		Если КолВУровне = 1 Тогда
			Вершина.Х =  5;
		ИначеЕсли КолВУровне = 2 Тогда
			Вершина.Х =  10*(НомерВУровне-1);
		ИначеЕсли КолВУровне = 3 Тогда
			Вершина.Х =  3*(НомерВУровне);
		Иначе
			Вершина.Х = выб.УровеньВВыборке();
		КонецЕсли;
		Вершина.У =  (ИНд-выб.УровеньВВыборке()) * ?(выб.ТипЭлементаДиалога = Справочники.ТипыЭлементовДиалогов.Выход,1.1,1);
		Вершина.Х = Вершина.Х *(?(выб.ТипЭлементаДиалога = Справочники.ТипыЭлементовДиалогов.Выход,1.5,1)); 
		Если Выб.Родитель.ТипЭлементаДиалога = Справочники.ТипыЭлементовДиалогов.Вопрос Тогда
			Вершина.Заряд = 0.6;
		ИначеЕсли Выб.ТипЭлементаДиалога = Справочники.ТипыЭлементовДиалогов.Старт Тогда
			Вершина.Заряд = 2;
		Иначе
			Вершина.Заряд = 1;
		КонецЕсли;
		
		
		
		Если ЗначениеЗаполнено(Выб.СледующийЭлемент) Тогда
			Нов = Обр.Ребра.Добавить();
			Нов.Имя1 = Вершина.Имя;
			Нов.Имя2 = Выб.СледующийЭлемент.НомерПП + Выб.СледующийЭлемент.Наименование;
			Если Выб.СледующийЭлемент.ТипЭлементаДиалога = Справочники.ТипыЭлементовДиалогов.Выход Тогда
				Нов.упругость=0.15;
			Иначе
				Нов.упругость=0.5;
			КонецЕсли;
			
		КонецЕсли;
		
		ЕСли ЗначениеЗаполнено(Выб.Родитель) Тогда
			Нов = Обр.Ребра.Добавить();
			Нов.Имя2 = Вершина.Имя;
			Нов.Имя1 = выб.Родитель.НомерПП+ Выб.Родитель.Наименование;
			Нов.упругость=1;
			
		КонецЕсли;
		ИНд = Инд+1;
	КонецЦикла;
	
	
	
	ОБр.Порог = 1;
	обр.ПоказыватьПроцесс = 1;
	обр.рассеивание();
	Ф.КнопкаПускНажатие();

КонецПроцедуры    

Процедура СправочникСписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если Найти(НРег(ИмяПользователя()),"узнец") Тогда
		
		АнимированныйГраф(ВыбраннаяСтрока);
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура СправочникСписокПриАктивизацииСтроки(Элемент)
	ТекстGv = Элемент.Текущаястрока.получитьОбъект().ТекстGv();
	Т = новый ТекстовыйДокумент;
	
	т.УстановитьТекст(ТекстGv);
	ИФ = ПолучитьИмяВременногоФайла("gv");
	ИФ2 = ПолучитьИмяВременногоФайла("png");
	ИФ3 = ПолучитьИмяВременногоФайла("gv");
	сп=новый СписокЗначений;
	сп.Добавить(КодировкаТекста.ANSI);
	сп.Добавить(КодировкаТекста.OEM);
	сп.Добавить(КодировкаТекста.UTF16);
	сп.Добавить(КодировкаТекста.UTF8);
	сп.Добавить(КодировкаТекста.Системная);
	//Сп.Добавить("UTF-8");Сп.Добавить("UTF-16");Сп.Добавить("UTF-16BE");Сп.Добавить("UTF-16LE");Сп.Добавить("UTF-32");Сп.Добавить("UTF-32BE");Сп.Добавить("UTF-32LE");Сп.Добавить("UTF16_PlatformEndian");Сп.Добавить("UTF16_OppositeEndian");Сп.Добавить("UTF32_PlatformEndian");Сп.Добавить("UTF32_OppositeEndian");Сп.Добавить("UTF-7");Сп.Добавить("IMAP-mailbox-name");Сп.Добавить("SCSU");Сп.Добавить("BOCU-1");Сп.Добавить("CESU-8");Сп.Добавить("ISO-8859-1");Сп.Добавить("US-ASCII");Сп.Добавить("gb18030");Сп.Добавить("IBM367");Сп.Добавить("iso-8859-2");Сп.Добавить("iso-8859-3");Сп.Добавить("iso-8859-4");Сп.Добавить("iso-8859-5");Сп.Добавить("iso-8859-6");Сп.Добавить("iso-8859-7");Сп.Добавить("iso-8859-8");Сп.Добавить("iso-8859-9");Сп.Добавить("iso-8859-13");Сп.Добавить("iso-8859-15");Сп.Добавить("cp932");Сп.Добавить("Shift_JIS");Сп.Добавить("EUC-JP");Сп.Добавить("cp33722");Сп.Добавить("windows-950");Сп.Добавить("Big5");Сп.Добавить("cp950");Сп.Добавить("Big5-HKSCS");Сп.Добавить("cp1386");Сп.Добавить("GBK");Сп.Добавить("GB2312");Сп.Добавить("GB_2312-80");Сп.Добавить("cp964");Сп.Добавить("cp949");Сп.Добавить("cp949c");Сп.Добавить("EUC-KR");Сп.Добавить("ibm-971");Сп.Добавить("KSC_5601");Сп.Добавить("ibm-1363");Сп.Добавить("windows-949");Сп.Добавить("windows-874");Сп.Добавить("cp874");Сп.Добавить("ibm-1162");Сп.Добавить("cp437");Сп.Добавить("cp737");Сп.Добавить("cp775");Сп.Добавить("cp850");Сп.Добавить("cp851");Сп.Добавить("cp852");Сп.Добавить("cp855");Сп.Добавить("cp856");Сп.Добавить("cp857");Сп.Добавить("cp858");Сп.Добавить("cp860");Сп.Добавить("cp861");Сп.Добавить("cp862");Сп.Добавить("cp863");Сп.Добавить("cp864");Сп.Добавить("cp865");Сп.Добавить("cp866");Сп.Добавить("ibm-867");Сп.Добавить("CP868");Сп.Добавить("cp869");Сп.Добавить("KOI8-R");Сп.Добавить("ibm-901");Сп.Добавить("ibm-902");Сп.Добавить("cp922");Сп.Добавить("KOI8-U");Сп.Добавить("ibm-4909");Сп.Добавить("windows-1250");Сп.Добавить("windows-1251");Сп.Добавить("windows-1252");Сп.Добавить("windows-1253");Сп.Добавить("windows-1254");Сп.Добавить("windows-1255");Сп.Добавить("windows-1256");Сп.Добавить("windows-1257");Сп.Добавить("windows-1258");Сп.Добавить("macintosh");Сп.Добавить("x-mac-greek");Сп.Добавить("x-mac-cyrillic");Сп.Добавить("x-mac-centraleurroman");Сп.Добавить("x-mac-turkish");Сп.Добавить("hp-roman8");Сп.Добавить("Adobe-Standard-Encoding");Сп.Добавить("cp1006");Сп.Добавить("cp1098");Сп.Добавить("cp1124");Сп.Добавить("cp1125");Сп.Добавить("ibm-1129");Сп.Добавить("cp1131");Сп.Добавить("ibm-1133");Сп.Добавить("ISO-2022-JP");Сп.Добавить("JIS_Encoding");Сп.Добавить("ISO-2022-JP-2");Сп.Добавить("ISO_2022,locale=ja,version=3");Сп.Добавить("ISO_2022,locale=ja,version=4");Сп.Добавить("ISO-2022-KR");Сп.Добавить("ISO_2022,locale=ko,version=1");Сп.Добавить("ISO-2022-CN");Сп.Добавить("ISO-2022-CN-EXT");Сп.Добавить("HZ-GB-2312");Сп.Добавить("windows-57002");Сп.Добавить("windows-57003");Сп.Добавить("windows-57011");Сп.Добавить("windows-57010");Сп.Добавить("windows-57007");Сп.Добавить("windows-57004");Сп.Добавить("windows-57005");Сп.Добавить("windows-57008");Сп.Добавить("windows-57009");Сп.Добавить("LMBCS-1");Сп.Добавить("LMBCS-2");Сп.Добавить("LMBCS-3");Сп.Добавить("LMBCS-4");Сп.Добавить("LMBCS-5");Сп.Добавить("LMBCS-6");Сп.Добавить("LMBCS-8");Сп.Добавить("LMBCS-11");Сп.Добавить("LMBCS-16");Сп.Добавить("LMBCS-17");Сп.Добавить("LMBCS-18");Сп.Добавить("LMBCS-19");Сп.Добавить("IBM037");Сп.Добавить("ebcdic-de");Сп.Добавить("ebcdic-dk");Сп.Добавить("IBM278");Сп.Добавить("IBM280");Сп.Добавить("IBM284");Сп.Добавить("IBM285");Сп.Добавить("IBM290");Сп.Добавить("IBM297");Сп.Добавить("IBM420");Сп.Добавить("IBM424");Сп.Добавить("IBM500");Сп.Добавить("ibm-803");Сп.Добавить("IBM-Thai");Сп.Добавить("IBM870");Сп.Добавить("IBM871");Сп.Добавить("cp875");Сп.Добавить("IBM918");Сп.Добавить("cp930");Сп.Добавить("cp933");Сп.Добавить("cp935");Сп.Добавить("cp937");Сп.Добавить("cp939");Сп.Добавить("cp1025");Сп.Добавить("IBM1026");Сп.Добавить("IBM1047");Сп.Добавить("cp1097");Сп.Добавить("cp1112");Сп.Добавить("cp1122");Сп.Добавить("cp1123");Сп.Добавить("ibm-1130");Сп.Добавить("ibm-1132");Сп.Добавить("ibm-1137");Сп.Добавить("IBM01140");Сп.Добавить("IBM01141");Сп.Добавить("IBM01142");Сп.Добавить("IBM01143");Сп.Добавить("IBM01144");Сп.Добавить("IBM01145");Сп.Добавить("IBM01146");Сп.Добавить("IBM01147");Сп.Добавить("IBM01148");Сп.Добавить("IBM01149");Сп.Добавить("ibm-1153");Сп.Добавить("ibm-1154");Сп.Добавить("ibm-1155");Сп.Добавить("ibm-1156");Сп.Добавить("ibm-1157");Сп.Добавить("ibm-1158");Сп.Добавить("ibm-1160");Сп.Добавить("ibm-1164");Сп.Добавить("ibm-1364");Сп.Добавить("ibm-1371");Сп.Добавить("ibm-1388");Сп.Добавить("ibm-1390");Сп.Добавить("ibm-1399");Сп.Добавить("ibm-5123");Сп.Добавить("ibm-8482");Сп.Добавить("ibm-16684");Сп.Добавить("ibm-4899");Сп.Добавить("ibm-4971");Сп.Добавить("ebcdic-he");Сп.Добавить("ebcdic-ar");Сп.Добавить("ibm-37_P100-1995,swaplfnl");Сп.Добавить("ibm-1047_P100-1995,swaplfnl");Сп.Добавить("ibm-1140_P100-1997,swaplfnl");Сп.Добавить("ibm-1142_P100-1997,swaplfnl");Сп.Добавить("ibm-1143_P100-1997,swaplfnl");Сп.Добавить("ibm-1144_P100-1997,swaplfnl");Сп.Добавить("ibm-1145_P100-1997,swaplfnl");Сп.Добавить("ibm-1146_P100-1997,swaplfnl");Сп.Добавить("ibm-1147_P100-1997,swaplfnl");Сп.Добавить("ibm-1148_P100-1997,swaplfnl");Сп.Добавить("ibm-1149_P100-1997,swaplfnl");Сп.Добавить("ibm-1153_P100-1999,swaplfnl");Сп.Добавить("ibm-12712_P100-1998,swaplfnl");Сп.Добавить("ibm-16804_X110-1999,swaplfnl");Сп.Добавить("ebcdic-xml-us");
	//эл=сп.ВыбратьЭлемент();
	т.Записать(ИФ);
	
	сер = ЗначениеВСтрокуВнутр(Новый ДвоичныеДанные(ИФ));
	
	ДД = ЗначениеИзСтрокиВнутр(СтрЗаменить(сер,"#base64:77u/","#base64:"));
	
	ДД.Записать(ИФ);
	КС = "\\cd\root\0_4_ИТ\Кухня_Полли\dot.exe -Tpng -o"""+ИФ2+""" """+ИФ+"""";
	//ЗапуститьПриложение("cmd /C "+КС+"",,Истина);
	WshShell.Run(КС,0,1);
	файл = Новый файл(ИФ2);
		
	Если файл.Существует() Тогда
		
		к=новый Картинка(ИФ2);
		ЭлементыФормы.ПолеКартинки.Картинка = к;	
	Иначе
		Сообщить(КС);
		Сообщить("cmd /C "+КС+";pause");
	КонецЕсли; 
	
	Элементы.Отбор.Владелец.Установить(Элемент.ТекущаяСтрока);
КонецПроцедуры    

СправочникСписок.Порядок.Установить("Действует Убыв");
